#include <iostream>
#include<Windows.h>
#include<string>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int i = 0, k;
    char ABC[] =
    {
                "абвгдеёжзийклмнопрстуфхцчшщъыьэюяабвгдеёжзийклмнопрстуфхцчшщъыьэюя"
    };
    char msg[150];
    cout << "Введите сообщение на русском языке строчными буквами\n------------------------------------------------------------------------------------------------\n\n";
    cin.getline(msg, 150);
    cout << "\n------------------------------------------------------------------------------------------------\nЕсли вы хотите зашифровать сообщение, введите сдвиг\nЕсли вы хотите расшифровать сообщение и вам известен ключ, введите знак минуса перед ним\n------------------------------------------------------------------------------------------------\n\n";
    cin >> k;
    cout << "\n------------------------------------------------------------------------------------------------";
    if (k > 33)
    {
        k = k % 33;
    }
    char* begin = ABC;
    char* end = ABC + sizeof(ABC);
    for (; msg[i]; ++i)
    {
        char* ch = find(begin, end, msg[i]);
        if (ch != end) msg[i] = *(begin + (ch - begin + k) % sizeof(ABC));
    }
    cout << "\nПолученное сообщение, скрытое от лишних умов :\n------------------------------------------------------------------------------------------------\n\n";
    cout << msg << "\n\n------------------------------------------------------------------------------------------------\n";
    return 0;
}
